---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.BankDistanceSmallerThanDiameter
source: html/c863bca0-0dbc-d24d-044f-d1dafe2947db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.BankDistanceSmallerThanDiameter Property

The distance value is smaller than the conduit diameter, please enter a larger value

## Syntax (C#)
```csharp
public static FailureDefinitionId BankDistanceSmallerThanDiameter { get; }
```